\
# Тема: Python программалоо тилинин эки функциясы
#  жана комментарии беруу жолу!
# 1)функция print()-Бул фукция терминалга маалымат (информация)чыгарып беруу жолун аткарат!

# 2)Функция input()-бул функция пользовательден суроо талап кылат!

# Python тилинде жонокой сандар инт (int) деп айтылат  алар: 1 2 3 4 5 6 7 8 9 10
# Ал эми болчок сандар болса флоат (float) деп айтылат алар болсо: 12,14,15,16 ж.б.

# практика
# from unicodedata import name


# print("Hello world")


# n = "17"
# print(n)

# input = ('веедите число' )
# print()

# f-12 
# print(f)


#  под тема:print жана анын аргументтери !!!
#  комментария деген эмне ?

# a = 12
# b = 14
# print(a, b, sep="-")
# #  sep- бул разделитель!
# print("Hello ", "end= ")
# print("World")

# Python тилиндеги математикалык операторлор!
# + (кошуу)
# -(кемитуу)
# * (кобойтуу)
# % (модуль боюнча болуу)

# print(2 * 2)
# print(7 + 91)
# print(9 - 6)
# print(5 % 8)
# """аябай чон коментарий

# python





#  кичине комментария

# python средасына кирш учун команда: python же python3
#  Ал эми чыгыш учун: guit()

# name = 'джон'
# print(name)

# a = 'python'
# print(a *  9)

# i = input ('введите первое число ')
# i2 = input ('введите второе число')



# from os i4mport sep

# a = 'baizak'
# print( a * 7 , sep = "  ")

# i = input ('введите первое число')
# i2 = ('введите второе число')
# print (i, i2, sep = '00' )
# Список представляет собой набор, который упорядочен и может быть изменен. Позволяет дублировать участников.
# Кортеж — это упорядоченная и неизменяемая коллекция. Позволяет дублировать участников.
# Набор — это неупорядоченная, неизменяемая* и неиндексированная коллекция. Нет повторяющихся членов.
# Словарь представляет собой сборник упорядоченный** и изменяемый. Нет повторяющихся членов