# 1) Каковы преимущества использования Python?

# 2)  В чем разница между кортежем и списком в Python?

# 3) В чем разница между списком и словарем в Python?

# 4) Как объединить несколько строк в Python?

# 5) Зачем нужны срезы в Python?

# 6) В чем разница между списковыми методами append() и extend() в Python?

# 7) Что такое Python?











# Напишите программу на Python, которая принимает имя и фамилию пользователя и печатает их в обратном порядке с пробелом между ними.


# Напишите программу на Python для отображения первого и последнего цветов из следующего списка.























# spisok = [10, 40, 20, 30]
# terminal :
# 12
# 42
# 22
# 32






















# Homework:

# Напишите программу на Python, которая печатает календарь на заданный месяц и год.
# Примечание. Используйте модуль «календарь».


# Напишите программу на Python для вычисления количества дней между двумя датами.
# Примеры дат : (2014, 7, 2), (2014, 7, 11)
# Ожидаемый результат : 9 дней

# Напишите программу на Python для проверки существования файла.


# Напишите программу на Python для печати без новой строки или пробела. С for


# интернет
