# тема: словар(dict)
# создук (dict) ачкыч маани жуg форматында маалыматарды сактаган структуралардын бири,ал озгоруучу типке кирген маалымат !
# Биз ачкычтарды колдонуп Python создук баалуулуктарына кире алабыз!

# пустой словарь жаратуу жолодору!
# 1 - жолу (переменый аркылуу)
# n = {}
# print(type(n))

# 2 - Жол
# ачкыч соз менен(dicr)
# dict = {}
# print(dict)

# словарь менен (dict)
# Ачкыч соз менен (dict)
# dict_sample = {1: 'mango', 2: 'pawpaw'} # --> бул жерде ачкыч ролун сан тармактары , ал эми строкалар бул маанилер!

# {} - фигурный скобка

# Ар кандай турдогу ачкычтар менен создук тузуу жолу :
# dict_simple = {'fruit': 'mango' , 1 : [4, 6, 8]}
# print(dict_simple)

# Ачкычты кайсы тур колдонулушу керек? 
# Эскертуу:созсуз озгорулгус маалымат туру гана колдонулушуу керек

# 2 - Том 

# Элементтерге доступ алуу
# Создуктун элементтерине доступ алуу учун , ачкычты торт бурчтуу кашаанеын ичинде жазыш керек [].
# мисалы:

# dict_simple = {"name": "Джон", "last_name": "Камбель"}
# x = dict_simple["name"]
# print(x)

# get()функциясы менен дагы элементтерге доступ алсак болот
# Мисалы:

# dict_simple = {"name": "Джон", "last_name": "Камбель"}
# x = dict_simple.get("name")
# print(x)
# каашага конул буралы

# Элементтерди кошуу
# Сөздүккө жаңы элементтерди кошуунун көптөгөн жолдору бар.
# Сиз жаңы ачкычты колдонуп, ага маани бере аласыз. Мисалы:
# dict = {"name": "f"}
# dict ["name"] = "tom"
# print(dict)

# Элементтерди жаңыртуу
# Сөздүккө маани кошкондон кийин, учурдагы сөздүк жазууну өзгөртүүгө болот.
# Тиешелүү баскыч маанини өзгөртүү үчүн колдонулат. 
# Мисалы:
# dict_sample = {
#     "Company": "Toyota", 
#     "model": "Camry", 
#     "year": 2012 
# } 
# dict_sample["Company"] = 'Bmw'
# print(dict_sample)

# Элементтерди алып салуу
# Сөздүктөн элементти алып салуу үчүн бир нече жолдору бар. Бул бөлүмдө алар бирден талкууланат:
# Del ачкыч сөзү белгилүү бир ачкыч менен элементти алып салуу үчүн колдонулушу мүмкүн. Мисалы:

# dict_sample = {
#   "Company": "Toyota", 
#   "model": "Premio", 
#   "year": 2012 
# }
# del dict_sample['model'] 
# print(dict_sample)

# Ачкыч-маани жуптарын жок кылуунун дагы бир жолу аргумент катары жазуу баскычы менен pop() функциясы. 
# Мисалы:
# dict_sample = {
#   "Company": "Toyota", 
#   "model": "Premio", 
#   "year": 2012 
# } 
# dict_sample.pop("Company") 
# print(dict_sample)

# Кээ бир учурларда сөздүктү бош калтырып, анын бардык элементтерин алып салуу зарыл болушу мүмкүн. Буга clear() функциясын колдонуу менен жетүүгө болот:
# Мисалы
# dict_sample = {
#   "Company": "Toyota", 
#   "model": "Premio", 
#   "year": 2012 
# } 
# dict_sample.clear() 
# print(dict_sample)






