
# тема: F - strind (строковые литералы)
# саптары: F-саптарды Python форматтонун жаны жана жакшыртылган жолу бул биздин коддун окулуусуна жана 
# жакшыптылган жол,мындайча айтканда эгер биз format кодончуу болсок , анда биздин код жондомдуу жана 
# коздуу болот!
# Мисалы: Конкетанция менен format'тын айырмасын королу..

# 1)конкетанция
# name = 'джон'
# age = '22'
# print('салам ' + name, 'а сен канча жаштасын? менин жашым' + age)

# 2) format
# name = 'Джон'
# age = '22'
# print("Салам {0}, а сен канча жаштасын? менин жашым {1}".format(name, age))

# Экинчи туру (Второй тип)

# name = 'Джон'
# age = '22'
# print("Салам {full}, а сен канча жаштасын? менин жашым {old}".format(full=name, old=age))

# 3) туру
# Python 3.6 версиясындан баштап бизге жаны формат кошулган, байкаштырып королу

# name = 'Джон'
# age = '22'
# print(f"салам", {name.upper()}, "а сен канча жаштасын? менин жашым", {age})





