# Тема: файлдар жана папкалар менен иштоо !

# папка менен иштоо командасы 
# 1. ls - Бул клманда текшеруу жаатын аткарат 
# 2. cd - Бул команда бир папкадан экинчи папкага отуу жолун аткарат
# 3. cd .. - папкадан чыгуу жолу
# 4.mkdir же  md - Папка ачуу командасы
# 5. rmdir же rd - папканы жок кылуу командасы 
# # 6. tree - Папканы бутагын кароо командасы

# Файл менен иштоо командасы
# # 1. del же  erase - Фавйлды жок кылуу командасы 
# # 2. ren же rename - Файлдын атын озгортуу командасы 
# # 3. tasklist - Иштеп жаткан процесстер
# # 4. help - жардам командасы (Справка)
# 5. touch же echo - файл ачуу командасы 


# ================================================================================

# try: - блок операторов критического кода
# excert(исключение): - блок операторов обработки исключение 
# finally: - блок операторов всегда исполняемых вне зависимости, от возникновения исключения