# тема: Шартуу операторлор(Условные операторы)
# if elif
# if англис тилинен алынганда эгерде (ЕСЛИ)болуп которулат, ал эми elif андыктан (ИНАЧЕ) - else 
# кобуроок(еще)
# and(и) 
# or(или)
# not(не)
# Операторлор (Операторы)
# > Больше
# < менше
# >= больще или равно 
# <= меньше или равно 
# == равно
# != Не равно
# >> Cдвиш в право 
# << Cдвиг в лево 

# Практика 

# test = input('Введите оценку: ')
# if test == '5':
#    print('Вы прошли экзамен ')
# elif test == '2':
#    print('Вы не прошли экзамен ')


# test = input('Введите оценку:')
# if test == '3':
#    print('Вы прошли экзамен')
# elif test == '4':
#    print('Вы не прошли экзамен ')

#  Опоератор or(или) - and(и)

# test = int(input('Введите оценку'))
# if test >= 4 and 5:
#    print('Вы прошли экзамен')
# elif test <= 2 and 3:
    # print('вы не прошли экзамен') 
 
# Оператор not
# Python программалоо тилинде дагы бир оператор бар, а оператор not!
# - Оператору чындыкты жалган кылат, жалганды чындык кылат деп вйтсак болот
#  (True --> False, False --> True)

# a = 100
# b = 100
# print(not(a))
# print(not(b))
# Python тилинде True -  бул бирге барабар, ал эми Faise - бул нолго барабар

# print(int(True))
# print(int(False))



# print(int(False))
# print(int(False))








