# Тема: Список(list)
# Python тилдериндеги тизмелер коомдук типтеги өзгөрмө жыйнактар.
# Python тилиндеги тизмелер ыктыярдуу типтеги объекттердин иреттелген өзгөрмө жыйнактары.
# Тизме ар кандай объекттердин каалаган санын камтышы мүмкүн (анын ичинде ички тизмелер) же эч нерсе
#  камтылбайт.
# Python тилинде тизме чарчы кашаа менен бөлүнгөн []

# Списки в Python - упорядоченные изменяемые коллекции объектов произвольных типов.
# Cписок может содержать любое количество любых объектов (в том числе и вложенные списки), или не содержать ничего.
# В Python список обозночается квадратными скобками []

# пустой список жаратуу жолдору:
# 1 жолу - переменный аркылуу
# os = []

# 2 жолу- бул ачкыч соз менен жараату жолу(list)
# list = []

# тип данных
# строка (str)
# Список(lis
# Boolen type (True, False)

# списоктун функциялары карап королу:

# 1) Функция len() - бул функция список жаатында канча элемент бар экенин аныктап берет
# Мисалы:

# list = (1, 2, 3, 4,)
# print(len(list))

# 2) функция max() - бул функция список элементтинде эн чон санын бизге чыгарып берет

# Мисалы:
# list = [12, 65, 45]
# print(max(list))

# 3) функция min() - бул функция список элементердин эн кичинекей санын бизге чыгарып берет
# Мисалы :
# os = [89,87,32]
# print(min(os))

# 4) функция sorted() - бул функция список элементердин сортировка кылып берет
# Мисалы:
# list = [45,67, 76, 95, 45]
# print(sorted(list))

# 5) Функция sum()- бул функция списоктун бааардык элемтерин кошуп бизге чыгарып берет
# Мисалы:
List = [1,5,6,7]
print(sum(list))


# Списоктун операторлору

# 1)кошуу оператору: +
# Мисалы :Бизде эки список бар список переменный менен аны кошуу жолун карап королу 
# a = [1]
# b = [2]
# чечуучу жолу 
# a = [1] + [2]
# print(a)

# 2) оператор in -  бул оператор список элеметердин биз издеген элемент барбы же жокпу аныктап берет
# Эскертуу: эгер элемент бар болсо анда бизге True чыгарып берет , ал эми жок болсо анда бизге Flue кайтарып берет
# Мисалы:
# list = [1, 'hello', 2]
# print(2 in list)

# 3) Оператор del - бул оператор список элементтин жок кылат!
# Мисалы:
# Эскертуу: Индекс аркылуу
    #   1  2
# k = [12,34]
# del k[0]
# print(k)








