# Тема: Список жаатын методдору(методы списка)

# 1)Метод append() - бул метод списоктун аягына элемент кошуу жолун аткарат
# Мисалы:
# list = ['Hello' , 1, 2, 3,]
# list.append(8)
# print(list)

# 2)Метод innsert() - Бул метод список жаатына элемент кошуу ролун аткарат
# Эскертуу:Индекс аркылуу
# Мисалы:
# list = [1, 2, 3, 4, 5,]
# list.insert(4,7)
# print(list)

# 3) Метод remove - Бул метод список жаатындагы элемент жок кылат
# мисалы:
# os = ['hello', 2, 3, 4,]
# os.remove(4)
# print(os)

# 4)Метод clear() - Бул метод список элементтерин баарын жокко чыгарат!
# Мисалы:
# a = [1, 2, 3, 4, 5, 6]
# a.clear(6)
# print(a)

# # 5) Метод  count() - Бул метод список жаатында бир элемент канча жолу кайталанып жатат, бизге 
# # аныктап берет
# # Мисалы:
# s = [1, 0, 1, 1,]
# print(s.count(1))

# 6) copy() - Бул метод список элементтерин копия кылуу жолун аткарат
# Мисалы:
# a = [1, 4, 7, 19]
# b = a.copy()
# print(a)

# # 7) index() - бул метод списоктун элементтерин индекс аркылуу бизге чыгарып берет, мындайча айтканда 
# # индексин бизге чыгарып берет
# # Мисалы:
# a = ['салам', 'hi']
# print(a.index('hi'))

# 8) sort - Бул метод список жаатын сортировка кылуу жолун аткарат
# мисалы:
# li = [1, 2, 3, 4, 19, 6]
# li.sort()
# print(li)





