# Fullstack - разработчики (Bekend, frontent)
# В классическом виде любой сайт технически состоит из нескольких элементов:
# дизайн, верстка, программный код, серверная часть, клиентская часть, контент, система управление содержимых или cms, доменное имя, хостинг.

# Синонимы Веб-сайт
# веб страницы, интернет ресурсы, портал сайт.

# Сайты бывают 
# коммерческие, информационные, социальные

# HTTP
# (англ.HYPERTEXT TRANSFER PROTOCOL)
# протокол передачи гипертекста
# -это протокол передачи данных изначально предназначенный для гипертекстовых (документов которые могут содержать ссылки для перехода к другим документам). Актуальная сейчас версия это HTTP 1.1 Также HTTP используется как транспортный протокол для других протколов прикладного уровня (SOAP, XML-RPC, WEBDAV). 
# Часто API программных продктов использует HTTP  для передачи данных в любом формате (XML, JSON и др.).
# Передача данных осуществляется через TCP\IP-соединения, обычно через TCP-порт 80.
# Метод(method, verb) - последовательность из любых символов, кроме управляющих и разделителей, которая определяет операцию, которую нужно осуществить с указанным ресурсом.
# GET: получение ресурса 
# POST: создание ресурса 
# PUT: обновление ресурса 
# DELETE: удаление ресурса
# HEAD: запрос заголовок страницы
# TRACE:трассировка страницы 
# OPTIONS: запррос поддерживаемых методов HTTP для ресурса 
# CONNECT: подключение к Web-серверу через прокси

# Статусы HTTP
# 1хх - информация
# 2хх - успешное выполнение (200 ОК)
# 3хх - перенаправление (301 - постоянное перемещение, 307 - временное перенаправление)
# 4хх - Ошибка на стороне клиента (403 - доступ запрещен, 404 - страницы не найдена)
# 5хх - Ошибка сервера (500 - внутренная ошибка сервера)
# URL: - Uniform Resource Identifer, уникальный идентификатор ресурса. Путь до конкретного ресурса, над которым нужно осуществить операцию 
# Пример URL: GET/users/10(запрашивает информацию по 10-ому пользователю).
# Основа World Wide Web Тим Бернерс-Ли в ЦЕРН предложил концепцию Web в 1989 году 

# HTML
# (HYPERTEXT MARKUP LANGUAGE)
# язык гипертекстовой разметки

# HTTPS
# HYPERTEXT TRANSFER PROTOCOL SECURE
# расширение протокола HTTP для подержки шифрования

# FTP
# (FILE  TRANSFER PROTOCOL)
# протокол передачи файлов по сети




