"""Урок 3"""

# тема: Маалымат туру (Тип данных)

# строка

# Строка юул тамга ыраатуулугу жана тырмакчага алынган суйлом , ал ирээттелген жана озгорбоочу маалымат туру!

# эшеоде сиз суйлом же тырмакчанын ичинде корсонуз анда бул тырмакча деп тушунсонуз болот !


# Строка эки тур болот , алар:

# бирдик (одинарный)   ''
 
# Экилдик (двойной)   "" 

# Конкетанация - бул эки же андан коп строканы кошуу жолу! (+)
# name = "аскар"
# name2 = '23'
# print (name + name2)


# строкалар менен операция:
# /n - бул оператор строканы кийинки строчка тушуру жаатын аткарат

# lang ='Python, n/Java'
# print(lang)
# * - бул лператор дубликат жаатын аткарат
# n = "Windom "
# print(n * 2)


# /t - бул опреатор таб (таблица) коюуу жаатын аткарат 
# Lang = 'Python /t Java' 
# print(Lang)
# /t -  бул таб койот.
#  Строканын функциялары:
# 1) Len () - Бул функция строка канча тамгадан итураарын аныктайт 
# os = 'Hello'
# print(os, len(os))

# неизменямый/ изменямый
# неупорядчивый/ упорядчивый

# type () - бул функция бизге кайсыл класска таандык аныктап берет!
# print(n,)
# pip = 'Python'
# print(pip, type(pip))
# a = 'python'
# print = ( a, lan (a))


# boolean Type(true False)
# True - чындык (правда или истинный)
# false - жалган(ложь)



































































































