# тема: Строкалардын методдору (методы строк)
# метод бул функция деп атасак да болот мындайча айтканда метод обектке кайрылган озгору формасын тузот!
# Эгерде сиз метод чакырсаныз эске алганыныз шарт строка бул озгорбочу типке кирген маалымат деп !



# 1) Метод title () - бул методд строканын биринчи тамгасын чон тамна кылып бизге чыгарып берет!
# Мисалы :

# strs = 'python'
# print(strs.title())

# 2)
# name = input ('Байзак:17   ')
# print(name.title())

# 2) метод upper() - бул метод строкадагы суйломдорду чон тамга кылып чыгарып берет!
# эскертуу: Баарын!
# Мисвлы:
# strs = 'world'
# print(strs.upper())

#3)Метод  lower() - бул метод срокадагы суйломдун баарын кичинекей тамга кылып чыгарып берет!
# Мисалы:
# strs = 'PYTHON'
# print(strs.lower())

#4)метод count() - бул метод строкада суйлом канча жолу кайталанып жаатарын аныктап берет!
# мисалы:
# strs =int(strs.count('a'))

# 5) Метод relase() - Бул метод строкадагы суйломдун бир тамгасын озгортконго мумкунчулук берет!
# Мисалы:
# strs = 'Hi'
# print(strs.replase('i' , 'I'))

# 6)Метод index() - Бул метод строканын индексин аныктап берет!
# Эскертуу: Эгер стока ичинде андай суйлом же тамга жок болсо анда бизге метод index ошибка чыгарып берет
#index 0.1.2.3.4.5.6.7.8.9.10

# Мисалы:
# strs = 'python'
# print(strs.index('n'))

# 7) метод isdigit() - Бул метод строка  буквадан турабы аныктап берет!
# Эскертуу: эгер буквадан турса анда бизге True чыгарып берет ал эми строка суйлом же пробелден
# турса анда бизге False  чыгарып берет 
# Мисалы:
# strs = '123'
# print(strs.isdigit())

# 8) isalpha

# 9) метод split() - Бул метод строканы болуу жаатын аткарат!
# мисалы:
# strs = 'салам мен разработчикмин!'
# print(strs.split())

# 10)метод find() - Бул строкадагы суйломдун индексин аныктап берет!
# ошибка чыгарбайт!
# Мисалы:
# strs = 'hello'
# print(strs.find('h'))

# метод точка коюлат
# функция утур