# Что такое кортежи?
# кортеж - это несколько значений записанных через запятую. 
# Например:

# rgb_colour = (255, 27, 559)
# name_and_age = ('Baizak , 56')
# three_booleans = (False, True, False)
# two_pairs_of_numbers = ((5, 7,), (8, 4))

# tuple = (42,)
# даже если ккортеж состоит из одного элемента то ставим запятую
# Одно из особенностей кортежей в том что это неизменямый тип данных - то есть изменить кортеж после создания уже нельзя. Чтобы добавит новое значения, нужно создать новый кортеж.
# name = ('Tom', 67)
# name[0] = 'Tom'
# Кортежи полезны когда нужно вернуть сразу несколько значений. 
# кортеж - это упорядочный и неизменяемый коллекция
# кортеж пишутся с круглыми скобками
# tuple = ()
# print(tuple)
# tuple = (1, 2, 3,)
# print(tuple)
# tuple = (1, "Hello" , 3.4)
# print(tuple)
# tuple = ("hi", [7, 7, 8]), (1, 3, 4,)
# print(tuple)

# tuple = ("p", "r", "o", "g", "r", "a", "m", "i", "z")
# # print(tuple[0])
# # print(tuple[6])
# print(tuple[-1])
# print(tuple[-4])
# car = ('toyota', 'camry', 'Bmw')
# for car in car:
#     print = (car)
b = (1, 2, 3, 8, 7, 6, 5, 5,)
print(b[5])
# b = (1, 2, 3, 8, 7, 6, 5, 5,)
# print(b[0:8])
